student_intervention_revisit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Supervised Learning: \\ Building a Student Intervention System</title>
<!-- 2017-06-16 Fri 14:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Robert M Salom" />
</head>
<body>
<div id="content">
<h1 class="title">Supervised Learning: \\ Building a Student Intervention System</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Obective</h2>
<div class="outline-text-2" id="text-1">
<p>
The goal of this project is to identify students who might need early intervention. We want to predict whether a given student will pass or fail
based on information about his life and habits. Therefore we approach this task as a classification problem with two classes, pass and fail.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Dataset</h2>
<div class="outline-text-2" id="text-2">
<p>
In what follows we will be working with part of the <a href="https://archive.ics.uci.edu/ml/datasets/student+performance">Student Performance Data Set</a> from the UCI machine learning repository. It is composed of
395 data points with 30 attributes each. The 31&rsquo;st attribute indicates whether the student passed or failed. Here is a brief description of 
each feature:
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Attributes for student-data.csv:</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> school - student&rsquo;s school (binary: &ldquo;GP&rdquo; or &ldquo;MS&rdquo;)</h4>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> sex - student&rsquo;s sex (binary: &ldquo;F&rdquo; - female or &ldquo;M&rdquo; - male)</h4>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> age - student&rsquo;s age (numeric: from 15 to 22)</h4>
</div>
<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> address - student&rsquo;s home address type (binary: &ldquo;U&rdquo; - urban or &ldquo;R&rdquo; - rural)</h4>
</div>
<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> famsize - family size (binary: &ldquo;LE3&rdquo; - less or equal to 3 or &ldquo;GT3&rdquo; - greater than 3)</h4>
</div>
<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> Pstatus - parent&rsquo;s cohabitation status (binary: &ldquo;T&rdquo; - living together or &ldquo;A&rdquo; - apart)</h4>
</div>
<div id="outline-container-sec-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="section-number-4">2.1.7</span> Medu - mother&rsquo;s education (numeric: 0 - none, 1 - primary education (4th grade), 2 – 5th to 9th grade, 3 – secondary education or 4 – higher education)</h4>
</div>
<div id="outline-container-sec-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="section-number-4">2.1.8</span> Fedu - father&rsquo;s education (numeric: 0 - none, 1 - primary education (4th grade), 2 – 5th to 9th grade, 3 – secondary education or 4 – higher education)</h4>
</div>
<div id="outline-container-sec-2-1-9" class="outline-4">
<h4 id="sec-2-1-9"><span class="section-number-4">2.1.9</span> Mjob - mother&rsquo;s job (nominal: &ldquo;teacher&rdquo;, &ldquo;health&rdquo; care related, civil &ldquo;services&rdquo; (e.g. administrative or police), &ldquo;at<sub>home</sub>&rdquo; or &ldquo;other&rdquo;)</h4>
</div>
<div id="outline-container-sec-2-1-10" class="outline-4">
<h4 id="sec-2-1-10"><span class="section-number-4">2.1.10</span> Fjob - father&rsquo;s job (nominal: &ldquo;teacher&rdquo;, &ldquo;health&rdquo; care related, civil &ldquo;services&rdquo; (e.g. administrative or police), &ldquo;at<sub>home</sub>&rdquo; or &ldquo;other&rdquo;)</h4>
</div>
<div id="outline-container-sec-2-1-11" class="outline-4">
<h4 id="sec-2-1-11"><span class="section-number-4">2.1.11</span> reason - reason to choose this school (nominal: close to &ldquo;home&rdquo;, school &ldquo;reputation&rdquo;, &ldquo;course&rdquo; preference or &ldquo;other&rdquo;)</h4>
</div>
<div id="outline-container-sec-2-1-12" class="outline-4">
<h4 id="sec-2-1-12"><span class="section-number-4">2.1.12</span> guardian - student&rsquo;s guardian (nominal: &ldquo;mother&rdquo;, &ldquo;father&rdquo; or &ldquo;other&rdquo;)</h4>
</div>
<div id="outline-container-sec-2-1-13" class="outline-4">
<h4 id="sec-2-1-13"><span class="section-number-4">2.1.13</span> traveltime - home to school travel time (numeric: 1 - &lt;15 min., 2 - 15 to 30 min., 3 - 30 min. to 1 hour, or 4 - &gt;1 hour)</h4>
</div>
<div id="outline-container-sec-2-1-14" class="outline-4">
<h4 id="sec-2-1-14"><span class="section-number-4">2.1.14</span> studytime - weekly study time (numeric: 1 - &lt;2 hours, 2 - 2 to 5 hours, 3 - 5 to 10 hours, or 4 - &gt;10 hours)</h4>
</div>
<div id="outline-container-sec-2-1-15" class="outline-4">
<h4 id="sec-2-1-15"><span class="section-number-4">2.1.15</span> failures - number of past class failures (numeric: n if 1&lt;=n&lt;3, else 4)</h4>
</div>
<div id="outline-container-sec-2-1-16" class="outline-4">
<h4 id="sec-2-1-16"><span class="section-number-4">2.1.16</span> schoolsup - extra educational support (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-17" class="outline-4">
<h4 id="sec-2-1-17"><span class="section-number-4">2.1.17</span> famsup - family educational support (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-18" class="outline-4">
<h4 id="sec-2-1-18"><span class="section-number-4">2.1.18</span> paid - extra paid classes within the course subject (Math or Portuguese) (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-19" class="outline-4">
<h4 id="sec-2-1-19"><span class="section-number-4">2.1.19</span> activities - extra-curricular activities (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-20" class="outline-4">
<h4 id="sec-2-1-20"><span class="section-number-4">2.1.20</span> nursery - attended nursery school (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-21" class="outline-4">
<h4 id="sec-2-1-21"><span class="section-number-4">2.1.21</span> higher - wants to take higher education (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-22" class="outline-4">
<h4 id="sec-2-1-22"><span class="section-number-4">2.1.22</span> internet - Internet access at home (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-23" class="outline-4">
<h4 id="sec-2-1-23"><span class="section-number-4">2.1.23</span> romantic - with a romantic relationship (binary: yes or no)</h4>
</div>
<div id="outline-container-sec-2-1-24" class="outline-4">
<h4 id="sec-2-1-24"><span class="section-number-4">2.1.24</span> famrel - quality of family relationships (numeric: from 1 - very bad to 5 - excellent)</h4>
</div>
<div id="outline-container-sec-2-1-25" class="outline-4">
<h4 id="sec-2-1-25"><span class="section-number-4">2.1.25</span> freetime - free time after school (numeric: from 1 - very low to 5 - very high)</h4>
</div>
<div id="outline-container-sec-2-1-26" class="outline-4">
<h4 id="sec-2-1-26"><span class="section-number-4">2.1.26</span> goout - going out with friends (numeric: from 1 - very low to 5 - very high)</h4>
</div>
<div id="outline-container-sec-2-1-27" class="outline-4">
<h4 id="sec-2-1-27"><span class="section-number-4">2.1.27</span> Dalc - workday alcohol consumption (numeric: from 1 - very low to 5 - very high)</h4>
</div>
<div id="outline-container-sec-2-1-28" class="outline-4">
<h4 id="sec-2-1-28"><span class="section-number-4">2.1.28</span> Walc - weekend alcohol consumption (numeric: from 1 - very low to 5 - very high)</h4>
</div>
<div id="outline-container-sec-2-1-29" class="outline-4">
<h4 id="sec-2-1-29"><span class="section-number-4">2.1.29</span> health - current health status (numeric: from 1 - very bad to 5 - very good)</h4>
</div>
<div id="outline-container-sec-2-1-30" class="outline-4">
<h4 id="sec-2-1-30"><span class="section-number-4">2.1.30</span> absences - number of school absences (numeric: from 0 to 93)</h4>
</div>
<div id="outline-container-sec-2-1-31" class="outline-4">
<h4 id="sec-2-1-31"><span class="section-number-4">2.1.31</span> passed - did the student pass the final exam (binary: yes or no)</h4>
</div>
</div>
</div>
</div>
</body>
</html>
